---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetRegisteredResults
source: html/3bb3ec29-db01-161b-8158-09fbda364603.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetRegisteredResults Method

Returns an array of indices of all registered results

## Syntax (C#)
```csharp
public IList<int> GetRegisteredResults()
```